Returns an instance DXFExportOptions containing settings from a predefined export setup.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2012
 Syntax
  C#
public static DXFExportOptions GetPredefinedOptions(
	Document document,
	string setup
)
  Visual Basic
Public Shared Function GetPredefinedOptions ( _
	document As Document, _
	setup As String _
) As DXFExportOptions
  Visual C++
public:
static DXFExportOptions^ GetPredefinedOptions(
	Document^ document,
	String^ setup
)
 Parameters
  document
 Type:  Autodesk.Revit.DB Document
 A Revit project document to retrieve the setup from.
  setup
 Type:  System String
 The name of a predefined export setup from the specified document.
 Return Value
 An instance of predefined DXFExportOptions, or    a null reference (  Nothing  in Visual Basic)  if the name was not found.
 Exceptions
  Exception  |   Condition
   Autodesk.Revit.Exceptions ArgumentException   |   document is not a project document.
   Autodesk.Revit.Exceptions ArgumentNullException   |   A non-optional argument was NULL
 See Also
  DXFExportOptions Class
  Autodesk.Revit.DB Namespace